zc110747/MCU-Agent/203.esp32s3_wireless_debug/sdkconfig.defaults
# ESP32-S3 CMSIS-DAP Debug Probe - default sdkconfig
CONFIG_IDF_TARGET="esp32s3"

# Console must stay on UART0 (GPIO43/44, onboard CH340).
# USB OTG (GPIO19/20) is reserved for the CMSIS-DAP HID interface.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# USB OTG
CONFIG_ESP_PHY_ENABLE_USB=n
